app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('phungquocvuong', '$2a$10$baVWEIAKAa0Gu5RCKMdbFuIL7j7pbbBH2Py16I7aylgAXdhVeTz6S', '2017-06-11 09:52:30', '2017-06-11 09:52:30')
---
def create
	@user = User.new user_params
	if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
def show
	@user = User.find_by id: params[:id]